/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Debuggen Sie Ihren JavaScript-Code im Chrome-Browser oder einem anderen Ziel, das das Chrome-Debuggerprotokoll unterstützt.",
	"chrome.toggleSkipping.title": "Chrome: Überspringen dieser Datei aktivieren/deaktivieren",
	"chrome.toggleSmartStep.title": "Chrome: Smart Step aktivieren/deaktivieren",
	"chrome.port.description": "Port zur Verwendung für das Remotedebuggen über Chrome.",
	"chrome.address.description": "TCP/IP-Adresse des Debugports",
	"chrome.file.description": "Eine lokale HTML-Datei zum Öffnen im Browser",
	"chrome.url.description": "Es wird nach einer Registerkarte mit dieser exakten URL gesucht und bei Erfolg ein Anfügevorgang durchgeführt.",
	"chrome.webRoot.description": "Gibt den absoluten Arbeitsbereichspfad zum Webserverstamm an. Wird zur Auflösung von Pfaden wie \"/app.js\" zu Dateien auf dem Datenträger verwendet. Kurzschreibweise für ein pathMapping für \"/\".",
	"chrome.pathMapping.description": "Ein Mapping von URLs/Pfaden zu lokalen Ordnern zum Auflösen von Skripts in Chrome in Skripts auf dem Datenträger.",
	"chrome.runtimeExecutable.description": "Absoluter Arbeitsbereichspfad zur ausführbaren Runtimedatei, die verwendet werden soll. Falls kein Pfad angegeben wird, wird Chrome vom Standardinstallationsort aus verwendet.",
	"chrome.runtimeArgs.description": "Optionale Argumente, die an die ausführbare Datei der Runtime übergeben werden.",
	"chrome.env.description": "Optionales Wörterbuch mit Schlüssel-Wert-Paaren der Umgebung.",
	"chrome.cwd.description": "Optionales Arbeitsverzeichnis für die ausführbare Runtimedatei.",
	"chrome.sourceMaps.description": "Hiermit werden JavaScript-Quellzuordnungsdateien verwendet (sofern vorhanden).",
	"chrome.diagnosticLogging.description": "Bei Festlegung auf TRUE protokolliert der Adapter eigene Diagnoseinformationen in einem lesbaren Format in der Konsole.",
	"chrome.verboseDiagnosticLogging.description": "Bei Festlegung auf TRUE protokolliert der Adapter den gesamten Datenverkehr mit Client und Ziel (sowie die über \"diagnosticLogging\" erfassten Informationen).",
	"chrome.trace.description": "Bei Festlegung auf TRUE protokolliert der Debugger Ablaufverfolgungsinformationen in einer Datei. Bei Festlegung auf \"verbose\" werden auch Protokolle in der Konsole angezeigt.",
	"chrome.userDataDir.description": "Standardmäßig wird Chrome mit einem separaten Benutzerprofil in einem temporären Ordner gestartet. Verwenden Sie diese Option, um die Standardeinstellung zu überschreiben. Legen Sie sie auf FALSE fest, um den Browser mit Ihrem Standardbenutzerprofil zu starten.",
	"chrome.sourceMapPathOverrides.description": "Eine Reihe von Zuordnungen zum Umschreiben der Speicherorte von Quelldateien gemäß Sourcemap in die Speicherorte auf dem Datenträger. Ausführliche Informationen finden Sie in der README-Datei.",
	"chrome.smartStep.description": "Automatisch nicht zugeordnete Zeilen in Sourcemapdateien durchlaufen, z.B. von TypeScript automatisch generierter Code beim Herunterkompilieren von async/await oder anderen Features.",
	"chrome.skipFiles.description": "Ein Array aus Datei- oder Ordnernamen oder Pfadglobs, die beim Debuggen übersprungen werden sollen.",
	"chrome.timeout.description": "Gibt den Zeitraum in Millisekunden an, nach dem erneut versucht wird, eine Verbindung mit Chrome herzustellen. Der Standardwert ist 10000 ms.",
	"chrome.disableNetworkCache.description": "Gibt ab, ob der Netzwerkcache für jede Anfrage übersprungen werden soll",
	"chrome.urlFilter.description": "Suchen Sie nach einer Seite mit dieser URL, und führen Sie eine Anfügung daran durch, wenn sie gefunden wird. Darf * als Platzhalter enthalten.",
	"chrome.targetTypes.description": "Ein Array von zulässigen Zieltypen. Der Standardwert ist \"[\"page\"]\".",
	"chrome.showAsyncStacks.description": "Hiermit werden die asynchronen Aufrufe angezeigt, die zur aktuellen Aufrufliste geführt haben",
	"chrome.breakOnLoad.description": "Experimentelle Funktion: Bei Festlegung auf TRUE versucht der Debugadapter, Haltepunkte in Skripts einzufügen, bevor diese geladen werden, damit der Adapter die Haltepunkte am Anfang der Skripts erreichen kann. Wirkt sich auf die Leistung aus.",
	"chrome.breakOnLoadStrategy.description": "Die für breakOnLoad zu verwendende Strategie.",
	"chrome.breakOnLoadStrategy.instrument.description": "Geben Sie an, dass Chrome beim Laden jedes Skripts anhalten soll, um Sourcemaps aufzulösen und Haltepunkte festzulegen.",
	"chrome.breakOnLoadStrategy.regex.description": "Legt Haltepunkte optimistisch in Dateien fest, die denselben Namen wie die Datei aufweisen, in der der Haltepunkt festgelegt ist."
}