{
	"extension.description": "Esegue il debug del codice JavaScript nel browser Chrome o in qualsiasi altra destinazione che supporti il protocollo Chrome Debugger.",
	"chrome.toggleSkipping.title": "Chrome: Attiva/disattiva Ignora questo file",
	"chrome.toggleSmartStep.title": "Chrome: Attiva/disattiva passaggio intelligente",
	"chrome.port.description": "Porta da usare per il debug remoto in Chrome.",
	"chrome.address.description": "Indirizzo TCP/IP della porta di debug",
	"chrome.file.description": "File HTML locale da aprire nel browser",
	"chrome.url.description": "Cerca una scheda con l'URL esatto e la collega ad esso se viene trovata",
	"chrome.webRoot.description": "Specifica il percorso assoluto dell'area di lavoro nella radice di webserver. Viene usato per risolvere percorsi come `/app.js` in file su disco. Forma abbreviata di pathMapping per \"/\"",
	"chrome.pathMapping.description": "Mapping di URL/percorsi di cartelle locali per risolvere gli script in Chrome in script su disco",
	"chrome.runtimeExecutable.description": "Percorso assoluto dell'area di lavoro dell'eseguibile del runtime da usare. Se non è specificato, Chrome verrà usato dal percorso di installazione predefinito.",
	"chrome.runtimeArgs.description": "Argomenti facoltativi passati all'eseguibile del runtime.",
	"chrome.env.description": "Dizionario facoltativo di coppie chiave/valore di ambiente.",
	"chrome.cwd.description": "Directory di lavoro facoltativa per l'eseguibile di runtime.",
	"chrome.sourceMaps.description": "Usa i source map JavaScript (se esistenti).",
	"chrome.diagnosticLogging.description": "Quando è true, l'adattatore registra le informazioni di diagnostica nella console in un formato leggibile",
	"chrome.verboseDiagnosticLogging.description": "Quando è true, l'adattatore registra tutto il traffico con il client e la destinazione (oltre alle informazioni registrate da 'diagnosticLogging')",
	"chrome.trace.description": "Se è 'true', il debugger registrerà informazioni di analisi in un file. Se è 'verbose', mostrerà anche i log nella console.",
	"chrome.userDataDir.description": "Per impostazione predefinita, Chrome viene avviato con un profilo utente separato in una cartella temporanea. Usare questa opzione per eseguirne l'override. Impostare su false per avviare con il profilo utente predefinito.",
	"chrome.sourceMapPathOverrides.description": "Set di mapping per riscrivere i percorsi dei file di origine dalle posizioni indicate nel mapping di origine alle relative posizioni sul disco. Per dettagli, vedere il file README.",
	"chrome.smartStep.description": "Esegue automaticamente un'istruzione alla volta delle righe non sottoposte a mapping nei file dei mapping di origine, ad esempio il codice che TypeScript produce automaticamente durante la generazione di JavaScript per async/await o altre funzionalità.",
	"chrome.skipFiles.description": "Matrice di nomi di file o di cartelle o GLOB di percorso da ignorare durante il debug.",
	"chrome.timeout.description": "Numero di millisecondi in cui vengono effettuati i tentativi di connessione a Chrome. Il valore predefinito è 10000 ms.",
	"chrome.disableNetworkCache.description": "Controlla se ignorare la cache di rete per ogni richiesta",
	"chrome.urlFilter.description": "Cerca una pagina con questo URL e la collega ad esso se viene trovata. Può contenere caratteri jolly (*).",
	"chrome.targetTypes.description": "Matrice di tipi di destinazione accettabili. L'impostazione predefinita è `[\"page\"]`.",
	"chrome.showAsyncStacks.description": "Mostra le chiamate asincrone che hanno causato lo stack di chiamate corrente",
	"chrome.breakOnLoad.description": "Funzionalità sperimentale. Se è impostata su true, l'adattatore di debug proverà a impostare i punti di interruzione negli script prima che vengano caricati, in modo che i punti di interruzione vengano raggiunti all'inizio di tali script. Influisce sulle prestazioni.",
	"chrome.breakOnLoadStrategy.description": "Strategia da usare per breakOnLoad.",
	"chrome.breakOnLoadStrategy.instrument.description": "Indica a Chrome di effettuare una sospensione durante il caricamento dei singoli script, risolvendo i mapping di origine e impostando i punti di interruzione",
	"chrome.breakOnLoadStrategy.regex.description": "Imposta i punti di interruzione in modalità ottimistica nei file con lo stesso nome del file in cui è impostato il punto di interruzione."
}