{
	"extension.description": "Awakutu kode Javascript anda dalam preamban Chrome, atau sasaran lain yang mendukung protokol Awakutu Chrome (Chrome Debugger).",

	"chrome.toggleSkipping.title": "Chrome: Beralih Lewati Berkas Ini",
	"chrome.toggleSmartStep.title": "Chrome: Beralih Langkah Cerdas",

	"chrome.port.description": "Porta yang akan digunakan untuk awakutu remote Chrome.",
	"chrome.address.description": "alamat TCP/IP dari porta awakutu",
	"chrome.file.description": "Berkas html lokal untuk dibuka di peramban",
	"chrome.url.description": "Akan mencari tab dengan url ini SECARA PERSIS dan memasang pengawakutu, jika ditemukan",
	"chrome.webRoot.description": "Ini menentukan alur mutlak ruang kerja ke akar peladen jaringan. Digunakan untuk menyelesaikan jalur seperti `/app.js` ke berkas-berkas di diska. Singkatan untuk sebuah pathMapping untuk \"/\"",
	"chrome.pathMapping.description": "Sebuah pemetaan dari URL/jalur ke folder-folder lokal, untuk menyelesaikan skrip di Chrome menuju skrip di diska",
	"chrome.runtimeExecutable.description": "Alur mutlak ruang kerja menuju ke berkas tempo kerja yang dapat dieksekusi untuk digunakan. Jika tidak diberikan, Chrome yang akan digunakan adalah yang dari lokasi pemasangan bawaan.",
	"chrome.runtimeArgs.description": "Argumen opsional untuk diberikan ke berkas tempo kerja yang dapat dieksekusi.",
	"chrome.env.description": "Kamus opsional berisi pasangan kunci/nilai lingkungan.",
	"chrome.cwd.description": "Direktori bekerja opsional bagi berkas tempo kerja yang dapat dieksekusi.",
	"chrome.sourceMaps.description": "Gunakan pemetaan sumber JavaScript (jika ada).",
	"chrome.diagnosticLogging.description": "Ketika true, adaptor mencatat info diagnostiknya sendiri ke konsol dalam format yang dapat dibaca manusia",
	"chrome.verboseDiagnosticLogging.description": "Ketika true, adaptor mencatat semua lalu lintas dengan klien dan sasaran (serta info yang dicatat oleh 'diagnosticLogging')",
	"chrome.trace.description": "Ketika 'true', pengawakutu akan mencatat info pelacakan ke file. Ketika 'verbose', pengawakutu juga akan menampilkan log di konsol.",
	"chrome.userDataDir.description": "Secara bawaan, Chrome diluncurkan dengan profil pengguna terpisah di folder sementara. Gunakan opsi ini untuk mengesampingkan aturan ini. Atur ke false untuk meluncurkan dengan profil pengguna bawaan anda.",
	"chrome.sourceMapPathOverrides.description": "Satu set pemetaan untuk menulis ulang lokasi berkas sumber dari apa yang dikatakan oleh petasumber, ke lokasi mereka di diska. Lihat README untuk rinciannya.",
	"chrome.smartStep.description": "Secara otomatis melangkahi baris-baris yang tidak dipetakan dalam berkas-berkas petasumber. Contohnya, kode yang dihasilkan oleh TypeScript secara otomatis ketika mengkompilturunkan async/await atau fitur-fitur lain.",
	"chrome.skipFiles.description": "Sebuah larik berisi nama-nama berkas atau folder, atau glob-glob jalur untuk dilewati ketika mengawakutu.",
	"chrome.timeout.description": "Coba ulang setelah angka milidetik ini untuk menghubungkan ke Chrome. Bawaan adalah 10000 milidetik.",
	"chrome.disableNetworkCache.description": "Mengontrol apakah tembolok jaringan untuk setiap permintaan",
	"chrome.urlFilter.description": "Akan mencari sebuah halaman dengan url ini dan memasang pengawakutu ke halaman itu jika ditemukan. Dapat memiliki wildcard *.",
	"chrome.targetTypes.description": "Sebuah larik berisi tipe-tipe sasaran yang dapat diterima. Bawaaan adalah `[\"page\"]`.",
	"chrome.showAsyncStacks.description": "Tunjukkan panggilan-panggilan asynf yang mengarah ke tumpukan panggilan saat ini",
	"chrome.breakOnLoad.description": "Fitur percobaan  -  Jika true, adapter awakutu akan mencoba mengatur breakpoint dalam skrip sebelum mereka dimuat, sehingga adapter awakutu dapat mencapai titik awal breakpoint pada awal skrip tersebut. Berdampak pada kinerja.",
	"chrome.breakOnLoadStrategy.description": "Strategi yang akan digunakan untuk breakOnLoad.",
	"chrome.breakOnLoadStrategy.instrument.description": "Beritahu Chrome untuk mengambil jeda ketik setiap skrip dimupat, menyelesaikan petasumber dan mengatur breakpoint",
	"chrome.breakOnLoadStrategy.regex.description": "Mengatur breakpoint sejara optimis dalam berkas-berkas dengan nama yang sama dengan berkas dimana breakpoint telah diatur."
}