{
	"extension.description": "Debug your JavaScript code in the Chrome browser, or any other target that supports the Chrome Debugger protocol.",

	"chrome.toggleSkipping.title": "Chrome: Toggle Skipping This File",
	"chrome.toggleSmartStep.title": "Chrome: Toggle Smart Step",

	"chrome.port.description": "Port to use for Chrome remote debugging.",
	"chrome.address.description": "TCP/IP address of debug port",
	"chrome.file.description": "A local html file to open in the browser",
	"chrome.url.description": "Will search for a tab with this EXACT url and attach to it, if found",
	"chrome.webRoot.description": "This specifies the workspace absolute path to the webserver root. Used to resolve paths like `/app.js` to files on disk. Shorthand for a pathMapping for \"/\"",
	"chrome.pathMapping.description": "A mapping of URLs/paths to local folders, to resolve scripts in Chrome to scripts on disk",
	"chrome.runtimeExecutable.description": "Workspace absolute path to the runtime executable to be used. If not specified, Chrome will be used from the default install location.",
	"chrome.runtimeArgs.description": "Optional arguments passed to the runtime executable.",
	"chrome.env.description": "Optional dictionary of environment key/value pairs.",
	"chrome.cwd.description": "Optional working directory for the runtime executable.",
	"chrome.sourceMaps.description": "Use JavaScript source maps (if they exist).",
	"chrome.diagnosticLogging.description": "When true, the adapter logs its own diagnostic info to the console in a human readable format",
	"chrome.verboseDiagnosticLogging.description": "When true, the adapter logs all traffic with the client and target (as well as the info logged by 'diagnosticLogging')",
	"chrome.trace.description": "When 'true', the debugger will log tracing info to a file. When 'verbose', it will also show logs in the console.",
	"chrome.userDataDir.description": "By default, Chrome is launched with a separate user profile in a temp folder. Use this option to override it. Set to false to launch with your default user profile.",
	"chrome.sourceMapPathOverrides.description": "A set of mappings for rewriting the locations of source files from what the sourcemap says, to their locations on disk. See README for details.",
	"chrome.smartStep.description": "Automatically step through unmapped lines in sourcemapped files. For example, code that TypeScript produces automatically when downcompiling async/await or other features.",
	"chrome.skipFiles.description": "An array of file or folder names, or path globs, to skip when debugging.",
	"chrome.timeout.description": "Retry for this number of milliseconds to connect to Chrome. Default is 10000 ms.",
	"chrome.disableNetworkCache.description": "Controls whether to skip the network cache for each request",
	"chrome.urlFilter.description": "Will search for a page with this url and attach to it, if found. Can have * wildcards.",
	"chrome.targetTypes.description": "An array of acceptable target types. The default is `[\"page\"]`.",
	"chrome.showAsyncStacks.description": "Show the async calls that led to the current call stack",
	"chrome.breakOnLoad.description": "Experimental feature -  If true, the debug adapter will attempt to set breakpoints in scripts before they are loaded, so it can hit breakpoints at the beginnings of those scripts. Has a perf impact.",
	"chrome.breakOnLoadStrategy.description": "The strategy to use for breakOnLoad.",
	"chrome.breakOnLoadStrategy.instrument.description": "Tell Chrome to pause as each script is loaded, resolving sourcemaps and setting breakpoints",
	"chrome.breakOnLoadStrategy.regex.description": "Sets breakpoints optimistically in files with the same name as the file in which the breakpoint is set.",
	"debug.chrome.useV3.description": "Controls whether to delegate \"chrome\"-type launch configs to the js-debug extension.",
	"debug.chrome.useV3.deprecated": "This setting is deprecated - please use `debug.javascript.usePreview` instead"
}