{
	"extension.description": "Отладка кода JavaScript или любых других целевых объектов, поддерживающих протокол отладчика Chrome, в браузере Chrome.",
	"chrome.toggleSkipping.title": "Chrome: переключить пропуск этого файла",
	"chrome.toggleSmartStep.title": "Chrome: переключить смарт-шаг",
	"chrome.port.description": "Порт, используемый для удаленной отладки Chrome.",
	"chrome.address.description": "TCP/IP-адрес порта отладки",
	"chrome.file.description": "Локальный HTML-файл, который будет открыт в браузере.",
	"chrome.url.description": "Будет искать вкладку с точно таким же URL-адресом и подключится к ней в случае обнаружения.",
	"chrome.webRoot.description": "Этот параметр указывает абсолютный путь рабочей области к корневому каталогу веб-сервера. Используется для разрешения путей к файлам на диске (например, \"/app.js\"). Сокращение для pathMapping для \"/\".",
	"chrome.pathMapping.description": "Сопоставление URL-адресов или путей к локальным папкам для сопоставления сценариев в Chrome и сценариев на диске",
	"chrome.runtimeExecutable.description": "Абсолютный путь к исполняемому файлу среды выполнения в рабочей области. Если не указан, будет использовано расположение установки Chrome по умолчанию.",
	"chrome.runtimeArgs.description": "Необязательные аргументы, исполняемому файлу среды выполнения.",
	"chrome.env.description": "Дополнительный словарь пар \"ключ/значение\" среды.",
	"chrome.cwd.description": "Дополнительный рабочий каталог для исполняемого файла среды выполнения.",
	"chrome.sourceMaps.description": "Использовать сопоставители с исходным кодом JavaScript (если они существуют).",
	"chrome.diagnosticLogging.description": "Если параметр имеет значение \"true\", адаптер выводит свои диагностические сведения в консоль в понятном формате.",
	"chrome.verboseDiagnosticLogging.description": "Если указано значение true, адаптер регистрирует весь трафик с клиентом и целевым объектом (а также сведения, регистрируемые \"diagnosticLogging\")",
	"chrome.trace.description": "Если задано значение \"true\", отладчик заносит сведения трассировки в файл. Если задано значение \"verbose\", он также отображает журналы в консоли.",
	"chrome.userDataDir.description": "По умолчанию Chrome запускается с отдельным профилем пользователя в папке temp. Используйте этот параметр, чтобы переопределить это поведение. Установите значение \"false\", чтобы запускать браузер с профилем пользователя по умолчанию.",
	"chrome.sourceMapPathOverrides.description": "Набор сопоставлений для переопределения расположений исходных файлов с указанных в сопоставителях с исходным кодом на реальные расположения на диске. Дополнительные сведения см. в файле сведений.",
	"chrome.smartStep.description": "Автоматический пропуск несопоставленных строк в файлах сопоставителей с исходным кодом. Например, кода, который автоматически формирует TypeScript при обратной компиляции async/await или других функций.",
	"chrome.skipFiles.description": "Массив имен файлов или папок либо стандартных масок, которые будут пропущены при отладке.",
	"chrome.timeout.description": "Повтор в течение указанного количества миллисекунд для подключения к Chrome. Значение по умолчанию — 10 000 мс.",
	"chrome.disableNetworkCache.description": "Определяет, нужно ли пропускать кэш сети для каждого запроса.",
	"chrome.urlFilter.description": "Будет искать страницу с этим URL-адресом и подключится к ней, если она найдена. Можно использовать подстановочные знаки *.",
	"chrome.targetTypes.description": "Массив допустимых типов целевых объектов. Значение по умолчанию — '[\"page\"]'.",
	"chrome.showAsyncStacks.description": "Отображение асинхронных вызовов, которые привели к текущему стеку вызовов",
	"chrome.breakOnLoad.description": "Экспериментальная функция — если установлено значение \"true\", то адаптер отладки попытается установить точки останова в сценариях перед их загрузкой, чтобы обеспечить срабатывание точек останова в начале этих сценариев. Эта функция оказывает влияние на производительность.",
	"chrome.breakOnLoadStrategy.description": "Стратегия, используемая для breakOnLoad.",
	"chrome.breakOnLoadStrategy.instrument.description": "Сообщает Chrome о том, что необходимо приостановить работу после загрузки каждого сценария для разрешения сопоставителей с исходным кодом и установки точек останова",
	"chrome.breakOnLoadStrategy.regex.description": "Оптимистично устанавливает точки останова в файлах с таким же именем, как у файла, в котором установлена точка останова."
}