{
	"extension.description": "Depura el código JavaScript en el explorador Chrome o en cualquier otro destino que admita el protocolo del depurador de Chrome.",
	"chrome.toggleSkipping.title": "Chrome: Alternar la omisión de este archivo",
	"chrome.toggleSmartStep.title": "Chrome: Alternar ejecución por pasos inteligente",
	"chrome.port.description": "Puerto que debe usarse para la depuración remota con Chrome.",
	"chrome.address.description": "Dirección TCP/IP del puerto de depuración.",
	"chrome.file.description": "Archivo HTML local para abrirlo en el explorador",
	"chrome.url.description": "Buscará una pestaña con esta dirección URL EXACTA y, si la encuentra, asociará la depuración a ella.",
	"chrome.webRoot.description": "Especifica la ruta de acceso absoluta del área de trabajo a la raíz del servidor web. Se usa para resolver rutas de acceso del tipo \"/app.js\" a archivos del disco. Forma abreviada para la asignación de rutas de acceso con \"/\".",
	"chrome.pathMapping.description": "Asignación de direcciones URL o rutas de acceso a carpetas locales para resolver scripts en Chrome como scripts en disco.",
	"chrome.runtimeExecutable.description": "Ruta de acceso absoluta del área de trabajo del archivo ejecutable del entorno de ejecución que debe usarse. Si no se especifica, se usará Chrome desde la ubicación de instalación predeterminada.",
	"chrome.runtimeArgs.description": "Argumentos opcionales pasados al ejecutable del entorno de ejecución.",
	"chrome.env.description": "Diccionario opcional de pares clave-valor de entorno.",
	"chrome.cwd.description": "Directorio de trabajo opcional para el archivo ejecutable del entorno de ejecución.",
	"chrome.sourceMaps.description": "Se usan los mapas de origen de JavaScript (si existen).",
	"chrome.diagnosticLogging.description": "Si se establece en true, el adaptador registra su propia información de diagnóstico en la consola con un formato legible por el ser humano.",
	"chrome.verboseDiagnosticLogging.description": "Si es true, el adaptador registra todo el tráfico en el cliente y el destino (así como la información que \"diagnosticLogging\" registra)",
	"chrome.trace.description": "Si es \"true\", el depurador registrará información de seguimiento en un archivo. Si es \"verbose\", también mostrará los registros en la consola.",
	"chrome.userDataDir.description": "De forma predeterminada, Chrome se inicia con un perfil de usuario diferente en una carpeta temporal. Utilice esta opción para reemplazar este comportamiento. Establézcala en false para iniciarlo con su perfil de usuario predeterminado.",
	"chrome.sourceMapPathOverrides.description": "Conjunto de asignaciones para reescribir las ubicaciones de los archivos de origen en sus ubicaciones en el disco, a partir de lo que indica el mapa de origen. Consulte el archivo LÉAME para obtener más detalles.",
	"chrome.smartStep.description": "Ejecuta paso a paso líneas no asignadas de archivos sin mapa de origen de forma automática. Por ejemplo, código que TypeScript produce automáticamente durante la compilación de async/await u otras características.",
	"chrome.skipFiles.description": "Matriz de nombres de archivo o carpeta, o patrones globales de ruta de acceso, que deben omitirse durante la depuración.",
	"chrome.timeout.description": "Vuelva a probar con este número de milisegundos para conectarse a Chrome. El valor predeterminado es 10000 ms.",
	"chrome.disableNetworkCache.description": "Controla si se omite la memoria caché de red para cada solicitud.",
	"chrome.urlFilter.description": "Buscará una página con esta dirección URL y, si la encuentra, asociará la depuración a ella. Puede tener caracteres comodín (*).",
	"chrome.targetTypes.description": "Matriz de tipos de destino aceptables. El valor predeterminado es \"[\"page\"]\".",
	"chrome.showAsyncStacks.description": "Muestra las llamadas asincrónicas de la pila de llamadas actual.",
	"chrome.breakOnLoad.description": "Característica experimental. Si se establece en true, el adaptador de depuración intentará establecer puntos de interrupción en los scripts antes de que se carguen, de modo que puede alcanzar puntos de interrupción al principio de esos scripts. Afecta al rendimiento.",
	"chrome.breakOnLoadStrategy.description": "Estrategia que debe usarse para breakOnLoad.",
	"chrome.breakOnLoadStrategy.instrument.description": "Indica a Chrome que haga una pausa cuando se carga cada script para resolver los mapas de origen y establecer puntos de interrupción",
	"chrome.breakOnLoadStrategy.regex.description": "Establece puntos de interrupción de forma optimista en archivos con el mismo nombre que el archivo donde se establece el punto de interrupción."
}