/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Debuguj kod JavaScript w przeglądarce Chrome lub dowolny inny obiekt docelowy obsługujący protokół debugera przeglądarki Chrome.",
	"chrome.toggleSkipping.title": "Chrome: przełącz pomijanie tego pliku",
	"chrome.toggleSmartStep.title": "Chrome: przełącz krok inteligentny",
	"chrome.port.description": "Port, który ma być używany do zdalnego debugowania w przeglądarce Chrome.",
	"chrome.address.description": "Adres TCP/IP portu debugowania",
	"chrome.file.description": "Lokalny plik html do otworzenia w przeglądarce",
	"chrome.url.description": "Wyszuka kartę z DOKŁADNIE takim adresem URL i podłączy się do niej, jeśli zostanie znaleziona",
	"chrome.webRoot.description": "Określa ścieżkę bezwzględną obszaru roboczego do katalogu głównego serwera internetowego. Służy do znajdowania plików na dysku dla ścieżek takich jak „/app.js”. Skrócona forma opcji pathMapping dla „/”",
	"chrome.pathMapping.description": "Mapowanie adresów URL/ścieżek na foldery lokalne na potrzeby znajdowania skryptów na dysku dla skryptów w przeglądarce Chrome",
	"chrome.runtimeExecutable.description": "Ścieżka bezwzględna obszaru roboczego do pliku wykonywalnego środowiska uruchomieniowego, który ma być używany. Jeśli nie zostanie określona, będzie używana przeglądarka Chrome z domyślnej lokalizacji instalacji.",
	"chrome.runtimeArgs.description": "Argumenty opcjonalne przekazywane do pliku wykonywalnego środowiska uruchomieniowego.",
	"chrome.env.description": "Opcjonalny słownik dla par klucz/wartość środowiska.",
	"chrome.cwd.description": "Opcjonalny katalog roboczy dla pliku wykonywalnego środowiska uruchomieniowego.",
	"chrome.sourceMaps.description": "Użyj mapy źródła JavaScript (jeśli istnieją).",
	"chrome.diagnosticLogging.description": "Gdy ma wartość true, karta rejestruje swoje własne informacje diagnostyczne w konsoli w postaci czytelnej dla użytkownika",
	"chrome.verboseDiagnosticLogging.description": "Gdy ma wartość true, adapter rejestruje cały ruch z klientem i elementem docelowym (jak również informacje rejestrowane przez funkcję „diagnosticLogging”)",
	"chrome.trace.description": "W przypadku ustawienia „true” debuger będzie rejestrował informacje o śledzeniu w pliku. W przypadku ustawienia „verbose” wyświetli również dzienniki w konsoli.",
	"chrome.userDataDir.description": "Domyślnie przeglądarka Chrome jest uruchamiana przy użyciu osobnego profilu użytkownika w folderze tymczasowym. Użyj tej opcji, aby przesłonić to ustawienie. Ustaw wartość false, aby uruchamianie odbywało się przy użyciu Twojego domyślnego profilu użytkownika.",
	"chrome.sourceMapPathOverrides.description": "Zestaw mapowań na potrzeby przepisania lokalizacji plików źródłowych z lokalizacji określonych przez mapę źródła do ich lokalizacji na dysku. Aby uzyskać szczegółowe informacje, zobacz plik README.",
	"chrome.smartStep.description": "Automatycznie przechodź przez niezamapowane wiersze w plikach typu sourcemapped. Na przykład kod, który język TypeScript tworzy automatycznie w przypadku kompilowania składni async/await lub innych funkcji.",
	"chrome.skipFiles.description": "Tablica nazw plików lub folderów albo wzorców globalnych ścieżek do pomijania podczas debugowania.",
	"chrome.timeout.description": "Ponawiaj przez tę liczbę milisekund próbę połączenia się z przeglądarką Chrome. Wartość domyślna to 10 000 ms.",
	"chrome.disableNetworkCache.description": "Określa, czy pamięć podręczna sieci ma być pomijana dla każdego żądania",
	"chrome.urlFilter.description": "Wyszuka kartę z tym adresem URL i dołączy do niej, jeśli zostanie znaleziona. Może zawierać symbole wieloznaczne *.",
	"chrome.targetTypes.description": "Tablica dozwolonych typów docelowych. Wartość domyślna to „[\"page\"]”.",
	"chrome.showAsyncStacks.description": "Pokaż wywołania asynchroniczne, które doprowadziły do bieżącego stosu wywołań",
	"chrome.breakOnLoad.description": "Funkcja eksperymentalna — w przypadku wartości true adapter debugowania podejmie próbę ustawienia punktów przerwania w skryptach przed ich załadowaniem, tak aby punkty przerwania były trafiane na początku tych skryptów. Ma to wpływ na wydajność.",
	"chrome.breakOnLoadStrategy.description": "Strategia na potrzeby ustawienia breakOnLoad.",
	"chrome.breakOnLoadStrategy.instrument.description": "Poinformuj przeglądarkę Chrome, że ma wstrzymywać działanie podczas ładowania poszczególnych skryptów w celu rozpoznania map źródeł i ustawienia punktów przerwania",
	"chrome.breakOnLoadStrategy.regex.description": "Optymistycznie ustawia punkty przerwania w plikach o takiej samej nazwie co plik, w którym punkt przerwania jest ustawiony."
}