/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Umožňuje ladit javascriptový kód v prohlížeči Chrome nebo v jakémkoli jiném cíli, který podporuje protokol Chrome Debugger.",
	"chrome.toggleSkipping.title": "Chrome: Přepnout možnost přeskočení tohoto souboru",
	"chrome.toggleSmartStep.title": "Chrome: Přepnout inteligentní krokování",
	"chrome.port.description": "Port, který se má použít pro vzdálené ladění Chromu",
	"chrome.address.description": "Adresa TCP/IP portu pro ladění",
	"chrome.file.description": "Místní soubor HTML, který se má otevřít v prohlížeči",
	"chrome.url.description": "Bude hledat kartu s touto přesnou adresou URL, a pokud ji najde, připojí se k ní.",
	"chrome.webRoot.description": "Určuje absolutní cestu pracovního prostoru ke kořenovému adresáři webového serveru. Používá se pro překlad cest k souborům na disku, například /app.js. Zkratka pro pathMapping pro /",
	"chrome.pathMapping.description": "Mapování adres URL nebo cest na místní složky, aby se mohl provést překlad skriptů v Chromu na skripty na disku",
	"chrome.runtimeExecutable.description": "Absolutní cesta pracovního prostoru ke spustitelnému souboru modulu runtime, který se má použít. Pokud se nezadá, použije se Chrome z výchozího umístění instalace.",
	"chrome.runtimeArgs.description": "Nepovinné argumenty se předaly do spustitelného souboru modulu runtime.",
	"chrome.env.description": "Volitelný slovník párů klíč-hodnota prostředí",
	"chrome.cwd.description": "Volitelný pracovní adresář pro spustitelný soubor modulu runtime",
	"chrome.sourceMaps.description": "Použijí se soubory sourcemap JavaScriptu (pokud existují).",
	"chrome.diagnosticLogging.description": "V případě hodnoty true adaptér zaznamená do konzoly svoje vlastní diagnostické informace ve formátu čitelném člověkem.",
	"chrome.verboseDiagnosticLogging.description": "V případě hodnoty true adaptér zaznamenává všechny přenosy s klientem a cílem (a také informace zaznamenané prostřednictvím atributu diagnosticLogging).",
	"chrome.trace.description": "V případě hodnoty true bude ladicí program zaznamenávat informace o trasování do souboru. V případě hodnoty verbose se budou protokoly zobrazovat také v konzole.",
	"chrome.userDataDir.description": "Chrome se ve výchozím nastavení spouští se samostatným uživatelským profilem v dočasné složce. Pomocí této možnosti se toto nastavení dá přepsat. Po nastavení na hodnotu false se aplikace bude spouštět s výchozím uživatelským profilem.",
	"chrome.sourceMapPathOverrides.description": "Sada mapování pro přepsání umístění zdrojových souborů z umístění podle sourcemapu na jejich umístění na disku. Podrobnosti najdete v souboru README.",
	"chrome.smartStep.description": "Automatické krokování pro nenamapované řádky v souborech sourcemap. Například kód, který TypeScript vytváří automaticky při kompilaci async/await nebo jiných funkcí.",
	"chrome.skipFiles.description": "Pole s názvy souborů či složek nebo globy cesty, které se mají při ladění přeskočit",
	"chrome.timeout.description": "Opakované pokusy o připojení k Chromu se budou provádět tento počet milisekund. Výchozí hodnota je 10 000 ms.",
	"chrome.disableNetworkCache.description": "Určuje, jestli se má u každého požadavku přeskočit mezipaměť sítě.",
	"chrome.urlFilter.description": "Bude hledat stránku s touto adresou URL, a pokud ji najde, připojí se k ní. Může obsahovat zástupné znaky *.",
	"chrome.targetTypes.description": "Pole obsahující přípustné typy cílů. Výchozí nastavení je [\"page\"].",
	"chrome.showAsyncStacks.description": "Zobrazí se asynchronní volání, která vedla k aktuálnímu zásobníku volání.",
	"chrome.breakOnLoad.description": "Experimentální funkce – V případě hodnoty true se adaptér ladění pokusí nastavit zarážky ve skriptech před jejich načtením, aby se při spuštění těchto skriptů mohl na těchto zarážkách zastavit. Tato funkce má vliv na výkon.",
	"chrome.breakOnLoadStrategy.description": "Strategie, která se má použít pro funkci breakOnLoad",
	"chrome.breakOnLoadStrategy.instrument.description": "Nastaví pozastavení Chromu při načítání každého skriptu za účelem překladu sourcemapů a nastavení zarážek.",
	"chrome.breakOnLoadStrategy.regex.description": "Nastaví zarážky optimisticky do souborů se stejným názvem, jaký má soubor, ve kterém je zarážka nastavena."
}