/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "JavaScript kodunuzun hatalarını Chrome tarayıcısında veya Chrome Debugger protokolünü destekleyen başka bir hedefte ayıklayın.",
	"chrome.toggleSkipping.title": "Chrome: Bu Dosyayı Atlamayı Aç/Kapat",
	"chrome.toggleSmartStep.title": "Chrome: Akıllı Adımı Aç/Kapat",
	"chrome.port.description": "Chrome uzaktan hata ayıklama için kullanılacak bağlantı noktası.",
	"chrome.address.description": "Hata ayıklama bağlantı noktasının TCP/IP adresi",
	"chrome.file.description": "Tarayıcıda açmak için bir yerel html dosyası",
	"chrome.url.description": "Tam olarak bu URL'yi içeren bir sekme arar ve bulunursa sekmeye ekler",
	"chrome.webRoot.description": "Bu, web sunucusu kökü için çalışma alanı mutlak yolunu belirtir. `/app.js` gibi yolları diskte dosyalara çözümlemek için kullanılır. \"/\" için pathMapping öğesine yönelik kısaltma",
	"chrome.pathMapping.description": "URL'lerin/yolların yerel dosyalara eşlenmesi, Chrome'daki betikleri diskteki betiklere çözümler",
	"chrome.runtimeExecutable.description": "Kullanılacak çalışma zamanı yürütülebilir dosyasının çalışma alanına yönelik mutlak yol. Yol belirtilmemişse, varsayılan yükleme konumundaki Chrome kullanılır.",
	"chrome.runtimeArgs.description": "Çalışma zamanı yürütülebilir dosyasına geçirilen isteğe bağlı bağımsız değişkenler.",
	"chrome.env.description": "İsteğe bağlı ortam anahtar/değer çifti sözlüğü.",
	"chrome.cwd.description": "Çalışma zamanı yürütülebilir dosyası için isteğe bağlı çalışma dizini.",
	"chrome.sourceMaps.description": "(Varsa) JavaScript kaynak eşlemelerini kullanın.",
	"chrome.diagnosticLogging.description": "Değer true olduğunda, bağdaştırıcı kendi tanılama bilgilerini insanlar tarafından okunabilir bir biçimde konsola kaydeder",
	"chrome.verboseDiagnosticLogging.description": "Değer true olduğunda bağdaştırıcı, istemci ve hedefin tüm trafiğini (ve ayrıca 'diagnosticLogging' tarafından günlüğe kaydedilen bilgileri) günlüğe kaydeder",
	"chrome.trace.description": "Değer 'true' olduğunda hata ayıklayıcısı, izleme bilgilerini bir dosyaya kaydeder. 'verbose' olduğunda ayrıca günlükleri konsolda gösterir.",
	"chrome.userDataDir.description": "Varsayılan olarak, Chrome geçici klasördeki ayrı bir kullanıcı profili ile başlatılır. Ayarı geçersiz kılmak için bu seçeneği kullanın. Varsayılan kullanıcı profiliniz ile başlatmak için false olarak ayarlayın.",
	"chrome.sourceMapPathOverrides.description": "Kaynak dosyalarının konumlarını yeniden yazmak için, kaynak eşlemesinde belirtilen konumlardan dosyaların diskteki konumlarına yönelik bir dizi eşleme. Ayrıntılı bilgi için BENİOKU dosyasına bakın.",
	"chrome.smartStep.description": "Kaynak eşlemesi yapılmış dosyalardaki eşlenmemiş satırları otomatik olarak adımlar. Örneğin, async/await veya diğer özellikleri aşağı derlerken TypeScript tarafından otomatik olarak oluşturulan kod.",
	"chrome.skipFiles.description": "Hata ayıklama sırasında atlanacak dosya veya klasör adları dizisi ya da yol globları.",
	"chrome.timeout.description": "Chrome'a bağlanmak için bu kadar milisaniye boyunca yeniden deneyin. Varsayılan: 10.000 ms.",
	"chrome.disableNetworkCache.description": "Her istek için ağ önbelleğinin atlanıp atlanmayacağını denetler",
	"chrome.urlFilter.description": "Bu URL'yi içeren bir sayfa arar ve bulunursa sayfaya ekler. * joker karakterler içerebilir.",
	"chrome.targetTypes.description": "Kabul edilebilir hedef türleri dizisi. `[\"page\"]` varsayılandır.",
	"chrome.showAsyncStacks.description": "Geçerli çağrı yığınına yol açan zaman uyumsuz çağrıları göster",
	"chrome.breakOnLoad.description": "Deneysel özellik - True olduğunda, hata ayıklama bağdaştırıcısı betikler yüklenmeden önce betiklerde kesme noktaları ayarlamaya çalışır. Böylece hata ayıklama bağdaştırıcısı bu betiklerin başlangıcındaki kesme noktalarına ulaşabilir. Bu işlem, performans üzerinde etkilidir.",
	"chrome.breakOnLoadStrategy.description": "breakOnLoad için kullanılacak strateji.",
	"chrome.breakOnLoadStrategy.instrument.description": "Chrome'un her betik yüklenirken duraklamasını ve kaynak eşlemelerini çözümleyerek kesme noktalarını ayarlamasını sağlayın",
	"chrome.breakOnLoadStrategy.regex.description": "Kesme noktasının ayarlandığı dosya ile aynı ada sahip dosyalarda kesme noktalarını iyimser bir şekilde ayarlar."
}