/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "JavaScript-kódok hibakeresése a Chrome böngészőben vagy olyan célhelyen, ami támogatja a Chrome Debugger protokollt.",
	"chrome.toggleSkipping.title": "Fájl kihagyásának be- és kikapcsolása",
	"chrome.port.description": "Chrome távoli hibakereséshez használt port",
	"chrome.address.description": "A hibakeresési port TCP/IP-címe",
	"chrome.file.description": "A böngészőben megnyitott helyi HTML-fájl",
	"chrome.url.description": "Fület keres PONTOSAN ezzel az URL-címmel, és ha talál, akkor csatlakozik hozzá.",
	"chrome.webRoot.description": "Meghatározza a webszerver gyökérmappájának abszolút elérési útját. Az `/app.js` és hozzá hasonló elérési utakhoz határozza meg a lemezen lévő fájlokat. Rövidítés a pathMappinghoz a \"/\" értékhez.",
	"chrome.pathMapping.description": "URL-ek/elérési utak leképezése helyi mappákra, hogy a Chrome-ban található parancsfájlokhoz meghatározható legyen a lemezen hozzájuk tartozó fájlok.",
	"chrome.runtimeExecutable.description": "A használt futtatókörnyezet abszolút elérési útja. Ha nincs megadva, akkor a Chrome lesz használva az alapértelmezett telepítési helyéről.",
	"chrome.runtimeArgs.description": "A futtatókörnyezet számára átadott kiegészítő argumentumok.",
	"chrome.env.description": "Opcionális környezeti kulcs-érték párokat tartalmazó szótár",
	"chrome.cwd.description": "A futtatókörnyezet opcionális munkakönyvtára",
	"chrome.sourceMaps.description": "JavaScript-forráskódtérképek használata (ha léteznek).",
	"chrome.diagnosticLogging.description": "Ha az értéke igaz, az adapter a saját diagnosztikai információit a konzolra naplózza emberek által olvasható formátumban",
	"chrome.verboseDiagnosticLogging.description": "Ha igaz, az illesztő naplóz minden forgalmat a kliens és a cél között (illetve a 'diagnosticLogging' által naplózott információkat is)",
	"chrome.trace.description": "Ha értéke 'true', a hibakereső információkat naplóz egy fájlba. Ha értéke 'verbose', akkor a napló a konzolban is megjelenik.",
	"chrome.userDataDir.description": "Alapértelmezetten a Chrome egy külön felhasználói profillal indul egy ideiglenes mappában. Ha az alapértelmezett profiljával szeretné indítani, állítsa az értékét false-ra.",
	"chrome.sourceMapPathOverrides.description": "Szabályok, amelyek a forráskódtérképekben található forrásfájlokban leírt elérési utak lemezen lévő elérési útra való leképezésére szolgálnak.",
	"chrome.smartStep.description": "Olyan generált kódok automatikus átugrása, amelyeknek nem sikerül visszakövetni az eredeti forrását.",
	"chrome.skipFiles.description": "Fájlok és mappanevek tömbje vagy elérési út globális minták, amelyek ki vannak hagyva a hibakeresés során.",
	"chrome.timeout.description": "Meghatározza, hány ezredmásodpercig próbál kapcsolódni a Chrome-hoz. Alapértelmezett értéke 10000 ms.",
	"chrome.disableNetworkCache.description": "Meghatározza, hogy a hálózati gyorsítótár ki lesz-e hagyva minden hívás esetén",
	"chrome.urlFilter.description": "Oldalt keres ezzel az URL-címmel, és ha talál, akkor csatlakozik hozzá. Tartalmazhat * helyettesítő karaktert.",
	"chrome.showAsyncStacks.description": "Az aktuális hívási vermet eredményező aszinkron hívás megjelenítése"
}