/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Déboguer votre code JavaScript dans le navigateur Chrome, ou tout autre cible qui prend en charge le protocole Chrome Debugger.",
	"chrome.toggleSkipping.title": "Chrome : Activer/désactiver l'évitement de ce fichier",
	"chrome.toggleSmartStep.title": "Chrome : Activer/désactiver Smart Step",
	"chrome.port.description": "Port à utiliser pour le débogage à distance de Chrome.",
	"chrome.address.description": "Adresse TCP/IP du port de débogage",
	"chrome.file.description": "Un fichier html local à ouvrir dans le navigateur",
	"chrome.url.description": "Recherchera un onglet avec cette url exacte et l'attachera, s'il est trouvé",
	"chrome.webRoot.description": "Ceci spécifie le chemin absolu de l’espace de travail à la racine du serveur Web. Utilisé pour résoudre des chemins d’accès comme '/app.js' à des fichiers sur le disque. Raccourci pour un pathMapping pour \"/\"",
	"chrome.pathMapping.description": "Un mappage d’Urls/chemins d’accès aux dossiers locaux, pour résoudre les scripts dans Chrome et les scripts sur le disque",
	"chrome.runtimeExecutable.description": "chemin d’accès absolu au runtime exécutable à utiliser pour l'espace de travail. Si non spécifié, Chrome se servira de l’emplacement d’installation par défaut.",
	"chrome.runtimeArgs.description": "Arguments facultatifs passés à l'exécutable du runtime.",
	"chrome.env.description": "Dictionnaire optionnel de paires clé/valeur d’environnement.",
	"chrome.cwd.description": "Répertoire de travail optionnel pour le runtime exécutable.",
	"chrome.sourceMaps.description": "Utilisez des mappages de sources JavaScript (s'ils existent)",
	"chrome.diagnosticLogging.description": "Si vrai, l’adaptateur journalise sa propre information sur le diagnostic vers la console dans un format lisible par l’homme",
	"chrome.verboseDiagnosticLogging.description": "Quand la valeur est true, l'adaptateur journalise tout le trafic avec le client et la cible (ainsi que les informations journalisées par 'diagnosticLogging')",
	"chrome.trace.description": "Quand la valeur est 'true', le débogueur journalise les informations de suivi dans un fichier. Quand la valeur est 'verbose', il affiche également les journaux dans la console.",
	"chrome.userDataDir.description": "Par défaut, le Chrome est lancé avec un profil d’utilisateur distinct dans un dossier temporaire. Utilisez cette option pour la substituer. Mettre à false pour lancer avec votre profil d’utilisateur par défaut.",
	"chrome.sourceMapPathOverrides.description": "Ensemble de mappages pour la réécriture des emplacements des fichiers sources à partir des informations du mappage de source vers leurs emplacements sur le disque. Consultez le fichier README pour plus de détails.",
	"chrome.smartStep.description": "Exécutez pas à pas de façon automatique le code généré qui ne peut être mappé à la source d'origine.",
	"chrome.skipFiles.description": "Un tableau de noms de fichier ou de dossier, ou de chemin d’accès globs, à ignorer lors du débogage.",
	"chrome.timeout.description": "Réessayer pendant ce nombre de millisecondes de se connecter àChrome. La valeur par défaut est 10000 ms.",
	"chrome.disableNetworkCache.description": "Contrôle s’il faut ignorer le cache de réseau pour chaque requête",
	"chrome.urlFilter.description": "Recherchera une page avec cette url et l'attachera, si trouvée. Peut contenir des caractères génériques *.",
	"chrome.showAsyncStacks.description": "Afficher les appels asynchrones qui ont conduit à la pile des appels actuelle",
	"chrome.breakOnLoad.description": "Fonctionnalité expérimentale - Si true, l'adaptateur de débogage essaiera d'affecter les points d'arrêt dans les scripts avant de les charger afin d'atteindre les points d'arrêt au début de ces scripts. Cela a un impact sur les performances.",
	"chrome.breakOnLoadStrategy.description": "La stratégie à utiliser pour breakOnLoad.",
	"chrome.breakOnLoadStrategy.instrument.description": "Demande à Chrome de faire une pause quand chaque script est chargé, en résolvant les sourcemaps et en affectant les points d'arrêt",
	"chrome.breakOnLoadStrategy.regex.description": "Affecte les points d'arrêts de manière optimiste dans les fichiers avec le même nom que le fichier dans lequel le point d'arrêt est affecté."
}